Repository: humblefoundation-zz/translation-support-files
Catalog: quran-imported/Pickethall.tmx
Source language: ar
Languages: en

source: يهدي إلى الرشد فآمنا به ولن نشرك بربنا أحدا
en: Which guideth unto righteousness, so we believe in it and we ascribe no partner unto our Lord.

source: وأنه تعالى جد ربنا ما اتخذ صاحبة ولا ولدا
en: And (we believe) that He - exalted be the glory of our Lord! - hath taken neither wife nor son,

source: وأنه كان يقول سفيهنا على الله شططا
en: And that the foolish one among us used to speak concerning Allah an atrocious lie.

source: وأنا ظننا أن لن تقول الإنس والجن على الله كذبا
en: And lo! we had supposed that humankind and jinn would not speak a lie concerning Allah -

source: وأنه كان رجال من الإنس يعوذون برجال من الجن فزادوهم رهقا
en: And indeed (O Muhammad) individuals of humankind used to invoke the protection of individuals of the jinn, so that they increased them in revolt against Allah);

source: وأنهم ظنوا كما ظننتم أن لن يبعث الله أحدا
en: And indeed they supposed, even as ye suppose, that Allah would not raise anyone (from the dead) -

source: وأنا لمسنا السماء فوجدناها ملئت حرسا شديدا وشهبا
en: And (the Jinn who had listened to the Qur'an said): We had sought the heaven but had found it filled with strong warders and meteors.

source: وأنا كنا نقعد منها مقاعد للسمع فمن يستمع الآن يجد له شهابا رصدا
en: And we used to sit on places (high) therein to listen. But he who listeneth now findeth a flame in wait for him;

source: وأنا لا ندري أشر أريد بمن في الأرض أم أراد بهم ربهم رشدا
en: And we know not whether harm is boded unto all who are in the earth, or whether their Lord intendeth guidance for them.

source: وأنا منا الصالحون ومنا دون ذلك كنا طرائق قددا
en: And among us there are righteous folk and among us there are far from that. We are sects having different rules.

source: وأنا ظننا أن لن نعجز الله في الأرض ولن نعجزه هربا
en: And we know that we cannot escape from Allah in the earth, nor can we escape by flight.

source: وأنا لما سمعنا الهدى آمنا به فمن يؤمن بربه فلا يخاف بخسا ولا رهقا
en: And when we heard the guidance, we believed therein, and whoso believeth in his Lord, he feareth neither loss nor oppression.

source: وأنا منا المسلمون ومنا القاسطون فمن أسلم فأولئك تحروا رشدا
en: And there are among us some who have surrendered (to Allah) and there are among us some who are unjust. And whoso hath surrendered to Allah, such have taken the right path purposefully.

source: وأما القاسطون فكانوا لجهنم حطبا
en: And as for those who are unjust, they are firewood for hell.

source: وأن لو استقاموا على الطريقة لأسقيناهم ماء غدقا
en: If they (the idolaters) tread the right path, We shall give them to drink of water in abundance

source: لنفتنهم فيه ومن يعرض عن ذكر ربه يسلكه عذابا صعدا
en: That We may test them thereby, and whoso turneth away from the remembrance of his Lord; He will thrust him into ever-growing torment.

source: وأن المساجد لله فلا تدعوا مع الله أحدا
en: And the places of worship are only for Allah, so pray not unto anyone along with Allah.

source: وأنه لما قام عبد الله يدعوه كادوا يكونون عليه لبدا
en: And when the slave of Allah stood up in prayer to Him, they crowded on him, almost stifling.

source: قل إنما أدعو ربي ولا أشرك به أحدا
en: Say (unto them, O Muhammad): I pray unto Allah only, and ascribe unto Him no partner.

source: قل إني لا أملك لكم ضرا ولا رشدا
en: Say: Lo! I control not hurt nor benefit for you.

source: قل إني لن يجيرني من الله أحد ولن أجد من دونه ملتحدا
en: Say: Lo! none can protect me from Allah, nor can I find any refuge beside Him

source: إلا بلاغا من الله ورسالاته ومن يعص الله ورسوله فإن له نار جهنم خالدين فيها أبدا
en: (Mine is) but conveyance (of the Truth) from Allah, and His messages; and whoso disobeyeth Allah and His messenger, lo! his is fire of hell, wherein such dwell for ever.

source: حتى إذا رأوا ما يوعدون فسيعلمون من أضعف ناصرا وأقل عددا
en: Till (the day) when they shall behold that which they are promised (they may doubt); but then they will know (for certain) who is weaker in allies and less in multitude.

source: قل إن أدري أقريب ما توعدون أم يجعل له ربي أمدا
en: Say (O Muhammad, unto the disbelievers): I know not whether that which ye are promised is nigh, or if my Lord hath set a distant term for it.

source: عالم الغيب فلا يظهر على غيبه أحدا
en: (He is) the Knower of the Unseen, and He revealeth unto none His secret,

source: إلا من ارتضى من رسول فإنه يسلك من بين يديه ومن خلفه رصدا
en: Save unto every messenger whom He hath chosen, and then He maketh a guard to go before him and a guard behind him

source: ليعلم أن قد أبلغوا رسالات ربهم وأحاط بما لديهم وأحصى كل شيء عددا
en: That He may know that they have indeed conveyed the messages of their Lord. He surroundeth all their doings, and He keepeth count of all things.

source: يا أيها المزمل
en: O thou wrapped up in thy raiment!

source: قم الليل إلا قليلا
en: Keep vigil the night long, save a little -

source: نصفه أو انقص منه قليلا
en: A half thereof, or abate a little thereof

source: أو زد عليه ورتل القرآن ترتيلا
en: Or add (a little) thereto - and chant the Qur'an in measure,

source: إنا سنلقي عليك قولا ثقيلا
en: For we shall charge thee with a word of weight.

source: إن ناشئة الليل هي أشد وطئا وأقوم قيلا
en: Lo! the vigil of the night is (a time) when impression is more keen and speech more certain.

source: إن لك في النهار سبحا طويلا
en: Lo! thou hast by day a chain of business.

source: واذكر اسم ربك وتبتل إليه تبتيلا
en: So remember the name of thy Lord and devote thyself with a complete devotion -

source: رب المشرق والمغرب لا إله إلا هو فاتخذه وكيلا
en: Lord of the East and the West; there is no Allah save Him; so choose thou Him alone for thy defender -

source: واصبر على ما يقولون واهجرهم هجرا جميلا
en: And bear with patience what they utter, and part from them with a fair leave-taking.

source: وذرني والمكذبين أولي النعمة ومهلهم قليلا
en: Leave Me to deal with the deniers, lords of ease and comfort (in this life); and do thou respite them awhile.

source: إن لدينا أنكالا وجحيما
en: Lo! with Us are heavy fetters and a raging fire,

source: وطعاما ذا غصة وعذابا أليما
en: And food which choketh (the partaker), and a painful doom

source: يوم ترجف الأرض والجبال وكانت الجبال كثيبا مهيلا
en: On the day when the earth and the hills rock, and the hills become a heap of running sand.

source: إنا أرسلنا إليكم رسولا شاهدا عليكم كما أرسلنا إلى فرعون رسولا
en: Lo! We have sent unto you a messenger as witness against you, even as We sent unto Pharaoh a messenger.

source: فعصى فرعون الرسول فأخذناه أخذا وبيلا
en: But Pharaoh rebelled against the messenger, whereupon We seized him with no gentle grip.

source: فكيف تتقون إن كفرتم يوما يجعل الولدان شيبا
en: Then how, if ye disbelieve, will ye protect yourselves upon the day which will turn children grey,

source: السماء منفطر به كان وعده مفعولا
en: The very heaven being then rent asunder. His promise is to be fulfilled.

source: إن هذه تذكرة فمن شاء اتخذ إلى ربه سبيلا
en: Lo! This is a Reminder. Let him who will, then, choose a way unto his Lord.

source: إن ربك يعلم أنك تقوم أدنى من ثلثي الليل ونصفه وثلثه وطائفة من الذين معك والله يقدر الليل والنهار علم أن لن تحصوه فتاب عليكم فاقرءوا ما تيسر من القرآن علم أن سيكون منكم مرضى وآخرون يضربون في الأرض يبتغون من فضل الله وآخرون يقاتلون في سبيل الله فاقرءوا ما تيسر منه وأقيموا الصلاة وآتوا الزكاة وأقرضوا الله قرضا حسنا وما تقدموا لأنفسكم من خير تجدوه عند الله هو خيرا وأعظم أجرا واستغفروا الله إن الله غفور رحيم
en: Lo! thy Lord knoweth how thou keepest vigil sometimes nearly two-thirds of the night, or (sometimes) half or a third thereof, as do a party of those with thee. Allah measureth the night and the day. He knoweth that ye count it not, and turneth unto you in mercy. Recite, then, of the Qur'an that which is easy for you. He knoweth that there are sick folk among you, while others travel in the land in search of Allah's bounty, and others (still) are fighting for the cause of Allah. So recite of it that which is easy (for you), and establish worship and pay the poor-due, and (so) lend unto Allah a goodly loan. Whatsoever good ye send before you for your souls, ye will find it with Allah, better and greater in the recompense. And seek forgiveness of Allah. Lo! Allah is Forgiving, Merciful.

source: يا أيها المدثر
en: O thou enveloped in thy cloak,

source: قم فأنذر
en: Arise and warn!

source: وربك فكبر
en: Thy Lord magnify,

source: وثيابك فطهر
en: Thy raiment purify,

source: والرجز فاهجر
en: Pollution shun!

source: ولا تمنن تستكثر
en: And show not favour, seeking wordly gain!

source: ولربك فاصبر
en: For the sake of thy Lord, be patient!

source: فإذا نقر في الناقور
en: For when the trumpet shall sound,

source: فذلك يومئذ يوم عسير
en: Surely that day will be a day of anguish,

source: على الكافرين غير يسير
en: Not of ease, for disbelievers.

source: ذرني ومن خلقت وحيدا
en: Leave Me (to deal) with him whom I created lonely,

source: وجعلت له مالا ممدودا
en: And then bestowed upon him ample means,

source: وبنين شهودا
en: And sons abiding in his presence

source: ومهدت له تمهيدا
en: And made (life) smooth for him.

source: ثم يطمع أن أزيد
en: Yet he desireth that I should give more.

source: كلا إنه كان لآياتنا عنيدا
en: Nay! For lo! he hath been stubborn to Our revelations.

source: سأرهقه صعودا
en: On him I shall impose a fearful doom.

source: إنه فكر وقدر
en: For lo! he did consider; then he planned -

source: فقتل كيف قدر
en: (Self-)destroyed is he, how he planned!

source: ثم قتل كيف قدر
en: Again (self-)destroyed is he, how he planned! -

source: ثم نظر
en: Then looked he,

source: ثم عبس وبسر
en: Then frowned he and showed displeasure.

source: ثم أدبر واستكبر
en: Then turned he away in pride

source: فقال إن هذا إلا سحر يؤثر
en: And said: This is naught else than magic from of old;

source: إن هذا إلا قول البشر
en: This is naught else than speech of mortal man.

source: سأصليه سقر
en: Him shall I fling unto the burning.

source: وما أدراك ما سقر
en: - Ah, what will convey unto thee what that burning is! -

source: لا تبقي ولا تذر
en: It leaveth naught; it spareth naught

source: لواحة للبشر
en: It shrivelleth the man.

source: عليها تسعة عشر
en: Above it are nineteen.

source: وما جعلنا أصحاب النار إلا ملائكة وما جعلنا عدتهم إلا فتنة للذين كفروا ليستيقن الذين أوتوا الكتاب ويزداد الذين آمنوا إيمانا ولا يرتاب الذين أوتوا الكتاب والمؤمنون وليقول الذين في قلوبهم مرض والكافرون ماذا أراد الله بهذا مثلا كذلك يضل الله من يشاء ويهدي من يشاء وما يعلم جنود ربك إلا هو وما هي إلا ذكرى للبشر
en: We have appointed only angels to be wardens of the Fire, and their number have We made to be a stumbling-block for those who disbelieve; that those to whom the Scripture hath been given may have certainty, and that believers may increase in faith; and that those to whom the Scripture hath been given and believers may not doubt; and that those in whose hearts there is disease, and disbelievers, may say: What meaneth Allah by this similitude? Thus Allah sendeth astray whom He will, and whom He will He guideth. None knoweth the hosts of thy Lord save Him. This is naught else than a Reminder unto mortals.

source: كلا والقمر
en: Nay, by the Moon

source: والليل إذ أدبر
en: And the night when it withdraweth

source: والصبح إذا أسفر
en: And the dawn when it shineth forth,

source: إنها لإحدى الكبر
en: Lo! this is one of the greatest (portents)

source: نذيرا للبشر
en: As a warning unto men,

source: لمن شاء منكم أن يتقدم أو يتأخر
en: Unto him of you who will advance or hang back.

source: كل نفس بما كسبت رهينة
en: Every soul is a pledge for its own deeds;

source: إلا أصحاب اليمين
en: Save those who will stand on the right hand.

source: في جنات يتساءلون
en: In gardens they will ask one another

source: عن المجرمين
en: Concerning the guilty:

source: ما سلككم في سقر
en: What hath brought you to this burning?

source: قالوا لم نك من المصلين
en: They will answer: We were not of those who prayed

source: ولم نك نطعم المسكين
en: Nor did we feed the wretched.

source: وكنا نخوض مع الخائضين
en: We used to wade (in vain dispute) with (all) waders,

source: وكنا نكذب بيوم الدين
en: And we used to deny the Day of Judgment,

source: حتى أتانا اليقين
en: Till the Inevitable came unto us.

source: فما تنفعهم شفاعة الشافعين
en: The mediation of no mediators will avail them then.

source: فما لهم عن التذكرة معرضين
en: Why now turn they away from the Admonishment,

source: كأنهم حمر مستنفرة
en: As they were frightened asses

source: فرت من قسورة
en: Fleeing from a lion?

source: بل يريد كل امرئ منهم أن يؤتى صحفا منشرة
en: Nay, but everyone of them desireth that he should be given open pages (from Allah).

source: كلا بل لا يخافون الآخرة
en: Nay, verily. They fear not the Hereafter.

source: كلا إنه تذكرة
en: Nay, verily. Lo! this is an Admonishment.

source: فمن شاء ذكره
en: So whosoever will may heed.

source: وما يذكرون إلا أن يشاء الله هو أهل التقوى وأهل المغفرة
en: And they will not heed unless Allah willeth (it). He is the fount of fear. He is the fount of Mercy.

source: لا أقسم بيوم القيامة
en: Nay, I swear by the Day of Resurrection;

source: ولا أقسم بالنفس اللوامة
en: Nay, I swear by the accusing soul (that this Scripture is true).

source: أيحسب الإنسان ألن نجمع عظامه
en: Thinketh man that We shall not assemble his bones?

source: بلى قادرين على أن نسوي بنانه
en: Yea, verily. We are Able to restore his very fingers!

source: بل يريد الإنسان ليفجر أمامه
en: But man would fain deny what is before him.

source: يسأل أيان يوم القيامة
en: He asketh: When will be this Day of Resurrection?

source: فإذا برق البصر
en: But when sight is confounded

source: وخسف القمر
en: And the moon is eclipsed

source: وجمع الشمس والقمر
en: And sun and moon are united,

source: يقول الإنسان يومئذ أين المفر
en: On that day man will cry: Whither to flee!

source: كلا لا وزر
en: Alas! No refuge!

source: إلى ربك يومئذ المستقر
en: Unto thy Lord is the recourse that day.

source: ينبأ الإنسان يومئذ بما قدم وأخر
en: On that day man is told the tale of that which he hath sent before and left behind.

source: بل الإنسان على نفسه بصيرة
en: Oh, but man is a telling witness against himself,

source: ولو ألقى معاذيره
en: Although he tender his excuses.

source: لا تحرك به لسانك لتعجل به
en: Stir not thy tongue herewith to hasten it.

source: إن علينا جمعه وقرآنه
en: Lo! upon Us (resteth) the putting together thereof and the reading thereof.

source: فإذا قرأناه فاتبع قرآنه
en: And when We read it, follow thou the reading;

source: ثم إن علينا بيانه
en: Then lo! upon Us (resteth) the explanation thereof.

source: كلا بل تحبون العاجلة
en: Nay, but ye do love the fleeting Now

source: وتذرون الآخرة
en: And neglect the Hereafter.

source: وجوه يومئذ ناضرة
en: That day will faces be resplendent,

source: إلى ربها ناظرة
en: Looking toward their Lord;

source: ووجوه يومئذ باسرة
en: And that day will other faces be despondent,

source: تظن أن يفعل بها فاقرة
en: Thou wilt know that some great disaster is about to fall on them.

source: كلا إذا بلغت التراقي
en: Nay, but when the life cometh up to the throat

source: وقيل من راق
en: And men say: Where is the wizard (who can save him now)?

source: وظن أنه الفراق
en: And he knoweth that it is the parting;

source: والتفت الساق بالساق
en: And agony is heaped on agony;

source: إلى ربك يومئذ المساق
en: Unto thy Lord that day will be the driving.

source: فلا صدق ولا صلى
en: For he neither trusted, nor prayed.

source: ولكن كذب وتولى
en: But he denied and flouted.

source: ثم ذهب إلى أهله يتمطى
en: Then went he to his folk with glee.

source: أولى لك فأولى
en: Nearer unto thee and nearer,

source: ثم أولى لك فأولى
en: Again nearer unto thee and nearer (is the doom).

source: أيحسب الإنسان أن يترك سدى
en: Thinketh man that he is to be left aimless?

source: ألم يك نطفة من مني يمنى
en: Was he not a drop of fluid which gushed forth?

source: ثم كان علقة فخلق فسوى
en: Then he became a clot; then (Allah) shaped and fashioned

source: فجعل منه الزوجين الذكر والأنثى
en: And made of him a pair, the male and female.

source: أليس ذلك بقادر على أن يحيي الموتى
en: Is not He (Who doeth so) Able to bring the dead to life?

source: هل أتى على الإنسان حين من الدهر لم يكن شيئا مذكورا
en: Hath there come upon man (ever) any period of time in which he was a thing unremembered?

source: إنا خلقنا الإنسان من نطفة أمشاج نبتليه فجعلناه سميعا بصيرا
en: Lo! We create man from a drop of thickened fluid to test him; so We make him hearing, knowing.

source: إنا هديناه السبيل إما شاكرا وإما كفورا
en: Lo! We have shown him the way, whether he be grateful or disbelieving.

source: إنا أعتدنا للكافرين سلاسل وأغلالا وسعيرا
en: Lo! We have prepared for disbelievers manacles and carcans and a raging fire.

source: إن الأبرار يشربون من كأس كان مزاجها كافورا
en: Lo! the righteous shall drink of a cup whereof the mixture is of Kafur,

source: عينا يشرب بها عباد الله يفجرونها تفجيرا
en: A spring wherefrom the slaves of Allah drink, making it gush forth abundantly,

source: يوفون بالنذر ويخافون يوما كان شره مستطيرا
en: (Because) they perform the vow and fear a day whereof the evil is wide-spreading,

source: ويطعمون الطعام على حبه مسكينا ويتيما وأسيرا
en: And feed with food the needy wretch, the orphan and the prisoner, for love of Him,

source: إنما نطعمكم لوجه الله لا نريد منكم جزاء ولا شكورا
en: (Saying): We feed you, for the sake of Allah only. We wish for no reward nor thanks from you;

source: إنا نخاف من ربنا يوما عبوسا قمطريرا
en: Lo! we fear from our Lord a day of frowning and of fate.

source: فوقاهم الله شر ذلك اليوم ولقاهم نضرة وسرورا
en: Therefor Allah hath warded off from them the evil of that day, and hath made them find brightness and joy;

source: وجزاهم بما صبروا جنة وحريرا
en: And hath awarded them for all that they endured, a Garden and silk attire;

source: متكئين فيها على الأرائك لا يرون فيها شمسا ولا زمهريرا
en: Reclining therein upon couches, they will find there neither (heat of) a sun nor bitter cold.

source: ودانية عليهم ظلالها وذللت قطوفها تذليلا
en: The shade thereof is close upon them and the clustered fruits thereof bow down.

source: ويطاف عليهم بآنية من فضة وأكواب كانت قواريرا
en: Goblets of silver are brought round for them, and beakers (as) of glass

source: قوارير من فضة قدروها تقديرا
en: (Bright as) glass but (made) of silver, which they (themselves) have measured to the measure (of their deeds).

source: ويسقون فيها كأسا كان مزاجها زنجبيلا
en: There are they watered with a cup whereof the mixture is of Zanjabil,

source: عينا فيها تسمى سلسبيلا
en: (The water of) a spring therein, named Salsabil.

source: ويطوف عليهم ولدان مخلدون إذا رأيتهم حسبتهم لؤلؤا منثورا
en: There wait on them immortal youths, whom, when thou seest, thou wouldst take for scattered pearls.

source: وإذا رأيت ثم رأيت نعيما وملكا كبيرا
en: When thou seest, thou wilt see there bliss and high estate.

source: عاليهم ثياب سندس خضر وإستبرق وحلوا أساور من فضة وسقاهم ربهم شرابا طهورا
en: Their raiment will be fine green silk and gold embroidery. Bracelets of silver will they wear. Their Lord will slake their thirst with a pure drink.

source: إن هذا كان لكم جزاء وكان سعيكم مشكورا
en: (And it will be said unto them): Lo! this is a reward for you. Your endeavour (upon earth) hath found acceptance.

source: إنا نحن نزلنا عليك القرآن تنزيلا
en: Lo! We, even We, have revealed unto thee the Qur'an, a revelation;

source: فاصبر لحكم ربك ولا تطع منهم آثما أو كفورا
en: So submit patiently to thy Lord's command, and obey not of them any guilty one or disbeliever.

source: واذكر اسم ربك بكرة وأصيلا
en: Remember the name of thy Lord at morn and evening.

source: ومن الليل فاسجد له وسبحه ليلا طويلا
en: And worship Him (a portion) of the night. And glorify Him through the livelong night.

source: إن هؤلاء يحبون العاجلة ويذرون وراءهم يوما ثقيلا
en: Lo! these love fleeting life, and put behind them (the remembrance of) a grievous day.

source: نحن خلقناهم وشددنا أسرهم وإذا شئنا بدلنا أمثالهم تبديلا
en: We, even We, created them, and strengthened their frame. And when We will, We can replace them, bringing others like them in their stead.

source: وما تشاءون إلا أن يشاء الله إن الله كان عليما حكيما
en: Yet ye will not, unless Allah willeth. Lo! Allah is Knower, Wise.

source: يدخل من يشاء في رحمته والظالمين أعد لهم عذابا أليما
en: He maketh whom He will to enter His mercy, and for evil-doers hath prepared a painful doom.

source: والمرسلات عرفا
en: By the emissary winds, (sent) one after another

source: فالعاصفات عصفا
en: By the raging hurricanes,

source: والناشرات نشرا
en: By those which cause earth's vegetation to revive;

source: فالفارقات فرقا
en: By those who winnow with a winnowing,

source: فالملقيات ذكرا
en: By those who bring down the Reminder,

source: عذرا أو نذرا
en: To excuse or to warn,

source: إنما توعدون لواقع
en: Surely that which ye are promised will befall.

source: فإذا النجوم طمست
en: So when the stars are put out,

source: وإذا السماء فرجت
en: And when the sky is riven asunder,

source: وإذا الجبال نسفت
en: And when the mountains are blown away,

source: وإذا الرسل أقتت
en: And when the messengers are brought unto their time appointed -

source: لأي يوم أجلت
en: For what day is the time appointed?

source: ليوم الفصل
en: For the Day of Decision.

source: وما أدراك ما يوم الفصل
en: And what will convey unto thee what the Day of Decision is! -

source: ويل يومئذ للمكذبين
en: Woe unto the repudiators on that day!

source: ألم نهلك الأولين
en: Destroyed We not the former folk,

source: ثم نتبعهم الآخرين
en: Then caused the latter folk to follow after?

source: كذلك نفعل بالمجرمين
en: Thus deal We ever with the guilty.

source: ألم نخلقكم من ماء مهين
en: Did We not create you from a base fluid

source: فجعلناه في قرار مكين
en: Which We laid up in a safe abode

source: إلى قدر معلوم
en: For a known term?

source: فقدرنا فنعم القادرون
en: Thus We arranged. How excellent is Our arranging!

source: ألم نجعل الأرض كفاتا
en: Have We not made the earth a receptacle

source: أحياء وأمواتا
en: Both for the living and the dead,

source: وجعلنا فيها رواسي شامخات وأسقيناكم ماء فراتا
en: And placed therein high mountains and given you to drink sweet water therein?

source: انطلقوا إلى ما كنتم به تكذبون
en: (It will be said unto them:) Depart unto that (doom) which ye used to deny;

source: انطلقوا إلى ظل ذي ثلاث شعب
en: Depart unto the shadow falling threefold,

source: لا ظليل ولا يغني من اللهب
en: (Which yet is) no relief nor shelter from the flame.

source: إنها ترمي بشرر كالقصر
en: Lo! it throweth up sparks like the castles,

source: كأنه جمالت صفر
en: (Or) as it might be camels of bright yellow hue.

source: هذا يوم لا ينطقون
en: This is a day wherein they speak not,

source: ولا يؤذن لهم فيعتذرون
en: Nor are they suffered to put forth excuses.

source: هذا يوم الفصل جمعناكم والأولين
en: This is the Day of Decision, We have brought you and the men of old together.

source: فإن كان لكم كيد فكيدون
en: If now ye have any wit, outwit Me.

source: إن المتقين في ظلال وعيون
en: Lo! those who kept their duty are amid shade and fountains,

source: وفواكه مما يشتهون
en: And fruits such as they desire.

source: كلوا وتمتعوا قليلا إنكم مجرمون
en: Eat and take your ease (on earth) a little. Lo! ye are guilty.

source: وإذا قيل لهم اركعوا لا يركعون
en: When it is said unto them: Bow down, they bow not down!

source: فبأي حديث بعده يؤمنون
en: In what statement, after this, will they believe?

source: عم يتساءلون
en: Whereof do they question one another?

source: عن النبإ العظيم
en: (It is) of the awful tidings,

source: الذي هم فيه مختلفون
en: Concerning which they are in disagreement.

source: كلا سيعلمون
en: Nay, but they will come to know!

source: ثم كلا سيعلمون
en: Nay, again, but they will come to know!

source: ألم نجعل الأرض مهادا
en: Have We not made the earth an expanse,

source: والجبال أوتادا
en: And the high hills bulwarks?

source: وخلقناكم أزواجا
en: And We have created you in pairs,
